% коэффициент усиления передающих антенн спиральных Луча-5М
% (по два сигнала на одну антенну)

function Gsat = power_AntennaTx_Luch5M(Teta0,signal)

% угол от оси антенны (в градусах)
%TetaAnt = [0,1,2,3,4,5,6,7,8,10,15];

% коэффициент усиления передающей антенны по точкам
if (strcmp(signal,'L1SBAS') || strcmp(signal,'L1KFD'))
    %GAnt = [17.8,17.7,17.6,17.5,17.4,17.2,17,16.7,16.4,16,13.9];
    %GAnt = [17.8,17.7,17.6,17.5,17.4,17.2,17,16.6,16.4,16,13.9];           % 16.6 заменено на 16.7 для более ровной зоны
    Lcorr = 0.8;                                                             % поправка, чтобы соответствовать последним данным: КУ в зоне (17 градусов = +/- 8.5 градусов) = 15.4
    TetaAnt = [0,5,12,20];
    GAnt = [17.5,17,15,10];
    
elseif strcmp(signal,'L5KFD')
    %GAnt = [14.6,14.55,14.5,14.4,14.3,14.2,14.1,14.05,13.9,13.7,12.5];
    %GAnt = [14.6,14.55,14.5,14.4,14.3,14.2,14.1,14.0,13.9,13.7,12.5];      % 14.05 заменено на 14.0 для более ровной зоны
    Lcorr = 0.6;                                                           % поправка, чтобы соответствовать последним данным: КУ в зоне (17 градусов = +/- 8.5 градусов) = 13.3
    TetaAnt = [0,5,10,15,22,30];
    GAnt = [14.5,14.3,13.7,12.7,10,5];

elseif (strcmp(signal,'L3KFD') || strcmp(signal,'L3Sigal'))
    %GAnt = [14.35,14.35,14.3,14.25,14.2,14.15,14.1,14.05,14,13.7,12.8];
    Lcorr = 0.5;                                                              % поправка, чтобы соответствовать последним данным: КУ в зоне (17 градусов = +/- 8.5 градусов) = 13.3
    TetaAnt = [0,5,10,15,22,30];
    GAnt = [14.4,14.2,13.6,12.6,10,5];
    
end

GAnt = GAnt - Lcorr;

% интерполяция 
Gsat = interp1(TetaAnt,GAnt,Teta0,'pchip');


% проверка
% figure(100)
% clf
% teta=0:0.5:20;
% G2 = interp1(TetaAnt,GAnt,teta,'pchip');
% plot(teta,G2)
% grid on