% коэффициент усиления передающей антенны (спиральной) в направлении на точку

function Gsat = power_AntennaTx(Teta0,signal)


% угол от оси антенны (в градусах)
TetaAnt = [0,0.8,1.5,2.3,3.1,3.8,4.4,5.1,5.7,6.3,6.8,7.2,7.7,8,8.3,8.5,8.7,8.9,13.9];

% коэффициент усиления передающей антенны по точкам для L1 SBAS
GAnt = [16.6,16.59,16.56,16.50,16.41,16.31,16.21,16.07,15.92,15.76,15.61,15.48,15.31,15.19,15.08,15.00,14.92,14.83,11.95];



if strcmp(signal,'L1SBAS') || strcmp(signal,'L1SDCM') || strcmp(signal,'L1SBASmax')
    
    Gsat = interp1(TetaAnt,GAnt,Teta0,'pchip');     % интерполяция

elseif strcmp(signal,'L5SBAS') || strcmp(signal,'L3SDCM')
    
    x = 0.0777*Teta0;
    Gsat = 14.064*abs(sin(x)/x);            % диаграмма направленности антенны с КУ 14,1 дБ и шириной ДН 30 градусов
    
end




